[
    {
        "id": 4,
        "title": "Strawdog Theatre",
        "url": "https://www.strawdog.org/",
        "platform": "Craft CMS",
        "image1": "/images/strawdog.jpg",
        "role": "Design, Front-End Development",
        "date": "2019",
        "description": "<p>I redesigned this theater company&#8217;s previous static site, reorganizing and adding content to enhance the user experience. I also developed it in Craft CMS for easy updating. The homepage is animated on first visit to draw the user in and hint at the dynamic nature of the company&#8217;s work.</p>"
    },
    {
        "id": 1,
        "title": "Elevate",
        "url": "https://www.elevatedigitalcommerce.com",
        "platform": "Statamic",
        "image1": "/images/elevate.jpg",
        "image1alt": "Elevate homepage",
        "image2": "/images/elevate-code.jpg",
        "image2alt": "code for the Elevate blog post template",
        "role": "Front-End Development, Design",
        "date": "2018",
        "description": "<p>I created all Statamic templates and the CSS for this agency website. Highlights include a show-more feature on the main blog page created using JSON and Javascript, performant images using srcset (and, of course, image optimization), and a pre-holiday planning checklist with animations created using Greensock. I also designed and built the blog&nbsp;pages.</p>"
    },
    {
        "id": 5,
        "title": "Keratin Complex",
        "url": "https://keratincomplex.com/",
        "platform": "Craft CMS/Shopify",
        "image1": "/images/keratin-complex.jpg",
        "image1alt": "Keratin Complex consumer site homepage",
        "role": "Front-End Development",
        "date": "2019",
        "description": "<p>Built in Craft CMS, with Shopify integration to handle checkout, this ecommerce site was developed to sell the company&#8217;s consumer and professional products. I used vanilla Javascript and PostCSS to build the site, along with JSON and Javscript to sort and display the many hair colors available on the professional&nbsp;side.</p>"
    },
    {
        "id": 2,
        "title": "Seed Phytonutrients",
        "platform": "Craft CMS",
        "image1": "/images/seed.jpg",
        "image1alt": "Seed Phytonutrients homepage",
        "image2": "/images/seed-scss.jpg",
        "image2alt": "Sass code for the Seed Phytonutrients product grid",
        "role": "Front-End Development",
        "date": "2018",
        "description": "<p>This marketing website was created to promote a new beauty brand prior to its ecommerce site launch. I created all Craft templates as well as the site&#8217;s CSS. Highlights include reusable components; a custom, accessible modal created with Javascript; and an animated search&nbsp;form.</p>"
    },
    {
        "id": 3,
        "title": "HanesInk",
        "platform": "IBM Websphere",
        "image1": "/images/hanesink.jpg",
        "role": "Front-End Development",
        "date": "2016",
        "description": "<p>I partnered with three other front-end developers as well as an off-site team of back-end developers to help create this customizable apparel site. The bulk of my work involved writing CSS and adding the related classes to the back-end code, tweaking the code when necessary (for example, to add conditional logic). The project inspired this <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://elevatedigitalcommerce.com/blog/from-comp-to-code-the-journey-of-a-button\">blog&nbsp;post</a>.</p>"
    }
]
